cfg/DataProcessors/ЗаполнениеГрафикаРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ЗаполнениеГрафикаРаботы</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>График</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cfg/InformationRegisters/ГрафикиРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ГрафикиРаботы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfg/DataProcessors/ЗаполнениеГрафикаРаботы/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	НаборЗаписей = РегистрыСведений.ГрафикиРаботы.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ГрафикРаботы.Установить(Объект.ГрафикРаботы);
	
	НаборЗаписей.Прочитать();
	
	СуществующиеЗаписи = Новый Соответствие;
	Для каждого Запись Из НаборЗаписей Цикл
		СуществующиеЗаписи.Вставить(Запись.Дата, Запись);
	КонецЦикла;
	
	НаборЗаписей.Очистить();
	
	ТекДата = Объект.Период.ДатаНачала;
	ДнейВНеделе = Объект.График.Количество(); 
	
	Пока ТекДата <= Объект.Период.ДатаОкончания Цикл
		
		НомерДня = (ТекДата - Объект.Период.ДатаНачала) / 86400 % ДнейВНеделе;
		
		Значение = Число(Объект.График[НомерДня].Значение);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Дата = ТекДата;
		НоваяЗапись.Значение = Значение;
		НоваяЗапись.ГрафикРаботы = Объект.ГрафикРаботы;
		
		ТекДата = ТекДата + 86400;
	КонецЦикла;
	
	НаборЗаписей.Записать();

КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры
